/** @file     uGxFont.h
    @author   Lyga Maksim
    @version  V1.0
    @date     13.06.2015
    @brief    Модуль реализует поддержку шрифтов в библиотеке uGx.
 */

#ifndef __uGx_FONT_H
#define __uGx_FONT_H

#ifdef __cplusplus
extern "C" {
#endif

/* ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ
 *************************************************************************************************/

#include "stdint.h"
#include "stddef.h"

/* КОНСТАНТЫ
 *************************************************************************************************/

/* МАКРОСЫ
 ************************************************************************************************/

/* ОПРЕДЕЛЕНИЕ ТИПОВ
 *************************************************************************************************/	 

/// Структура шрифта
typedef struct
{ 
  const uint16_t  Height;     ///< Высота шрифта
	const uint8_t   StartChar;
	const uint8_t   EndChar;
  const uint16_t *Descriptor; ///< Указатель на описание шрифта
  const uint8_t  *Bitmap;     ///< Указатель на массив прорисовки символов
} uGxFont_t;	
	
/* ОПРЕДЕЛЕНИЕ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
 *************************************************************************************************/

extern uGxFont_t Font_Arial_14pt;
extern uGxFont_t Font_Arial_20pt;
extern uGxFont_t Font_Digital_25pt;
extern uGxFont_t Font_Digital_40pt;

/* ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 *************************************************************************************************/	

// Функция возвращает высоту символов в пикселях для заданного шрифта
uint16_t uGx_GetFontHeight(uGxFont_t *pFont);
// Функция возвращает ширину строки в пикселях для заданного шрифта
uint16_t uGx_GetStrWeight(char *pString, uGxFont_t *pFont);

#ifdef __cplusplus
}
#endif

#endif
/*
** КОНЕЦ ФАЙЛА
***********************************************************************************************/
