/** @file     uGxImage.h
    @author   Lyga Maksim
    @version  V1.0
    @date     13.06.2015
    @brief    Модуль реализует поддержку изображений в библиотеке uGx.
 */

#ifndef __uGx_IMAGE_H
#define __uGx_IMAGE_H

#ifdef __cplusplus
extern "C" {
#endif

/* ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ
 *************************************************************************************************/
	
#include "stdint.h"

/* КОНСТАНТЫ
 *************************************************************************************************/

/* МАКРОСЫ
 ************************************************************************************************/

/* ОПРЕДЕЛЕНИЕ ТИПОВ
 *************************************************************************************************/	 

/// Структура изображения
typedef struct
{
	const uint16_t  Weight;      ///< Ширина изображения
	const uint16_t  Height;      ///< Высота изображения
  const uint16_t  Transparent; ///< Цвет фона изображения	
  const uint16_t *Bitmap;      ///< Указатель на массив прорисовки изображения
} uGxImage_t;	
	
	
/* ОПРЕДЕЛЕНИЕ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
 *************************************************************************************************/

extern uGxImage_t Lock_Image;

/* ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 *************************************************************************************************/	

#ifdef __cplusplus
}
#endif

#endif
/*
** КОНЕЦ ФАЙЛА
***********************************************************************************************/
