/** @file     uGxSetup.h
    @author   Lyga Maksim
    @version  V0.1
    @date     15.08.2015
 */

#ifndef __uGX_SETUP_H
#define __uGX_SETUP_H

#ifdef __cplusplus
extern "C" {
#endif

/* ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ
 ***********************************************************************************************/

/* МАСТЕР КОНФИГУРАЦИИ
 ***********************************************************************************************/
	 
//********************** <<< Use Configuration Wizard in Context Menu >>> **********************
//<h> uGx Librery Configuration
//  <o0> uGx messages buffer size
//       <4=>   4 messages
//       <8=>   8 messages
//       <16=>  16 messages
//       <32=>  32 messages
//       <64=>  64 messages
//       <128=> 128 messages
//</h> End of Configuration
	
#define __uGX_MSG_SIZE  16   ///< Максимальная длина командной строки (см. пункт Command line length Keil Configuration Wizard).

//**************************** <<< end of configuration section >>> ****************************

/* КОНСТАНТЫ
 ***********************************************************************************************/

/* МАКРОСЫ
 ***********************************************************************************************/

/* ОПРЕДЕЛЕНИЕ ТИПОВ
 ***********************************************************************************************/
	
/* ОПРЕДЕЛЕНИЕ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
 ***********************************************************************************************/

/* ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 ***********************************************************************************************/

/* ОПИСАНИЕ INLINE ФУНКЦИЙ
 ***********************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif
/*
** КОНЕЦ ФАЙЛА
***********************************************************************************************/
