/** @file     uGxSeparator.h
    @author   Lyga Maksim
    @version  V0.5
    @date     21.01.2016
    @brief    
 */

#ifndef __uGX_SEPARATOR_H
#define __uGX_SEPARATOR_H

#ifdef __cplusplus
extern "C" {
#endif

/* ПОДКЛЮЧЕНИЕ ЗАГОЛОВОЧНЫХ ФАЙЛОВ
 ***********************************************************************************************/

#include "uGxObject.h"
	
/* МАСТЕР КОНФИГУРАЦИИ
 ***********************************************************************************************/

/* КОНСТАНТЫ
 ***********************************************************************************************/

/* МАКРОСЫ
 ***********************************************************************************************/

/* ОПРЕДЕЛЕНИЕ ТИПОВ
 ***********************************************************************************************/

// Структура графического объекта
typedef struct
{
  uGx_ObjHeader_t   Header;        // заголовок графического объекта
	uint16_t          BgndColor;
	uint16_t          SeparatorColor;
} uGxSeparator_t;

/* ОПРЕДЕЛЕНИЕ ГЛОБАЛЬНЫХ ПЕРЕМЕННЫХ
 ***********************************************************************************************/

/* ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 ***********************************************************************************************/

// Функция создания объекта
void uGx_Separator_Add(uGxSeparator_t *pSeparator,   // указатель на графический объект
                       uGx_ObjState_t  State,       // начальный статус состояния объекта
                       uint16_t        Left,        // координата X верхнего левого угла объекта
                       uint16_t        Top,         // координата Y верхнего левого угла объекта
									     uint16_t        Width,       // ширина объекта
                       uint16_t        Height);     // высота объекта

// Функция установки цветовой схемы объекта
void uGx_Separator_SetColor(uGxSeparator_t *pSeparator,      // указатель на графический объект
                            uint16_t        BgndColor,       // координата Y верхнего левого угла объекта
                            uint16_t        SeparatorColor); // высота объекта

// Функция перерисовки объекта
void uGx_Separator_Draw(void *pObject);
	
/* ОПИСАНИЕ INLINE ФУНКЦИЙ
 ***********************************************************************************************/

#ifdef __cplusplus
}
#endif

#endif
/*
** КОНЕЦ ФАЙЛА
***********************************************************************************************/
